# for i in range(1, 4):
#     for j in range(3, 5):
#         print(i + j, end='')

# counter = 0
# for i in range(99, 102):
#     temp = i
#     while temp > 0:
#         counter += 1
#         temp //= 10
#
# print(counter)



#///////////////////////////////////////////////////////////////////////////////////////////

# n = int(input())
# for _ in range(0, n):
#     for i in range(3):
#         print(n, end=' ')
#     print()

#///////////////////////////////////////////////////////////////////////////////////////////

# n = int(input())
# for i in range(1, n + 1):
#     for j in range(1, 10):
#         print(f'{i} + {j} = {i + j}')
#     print()

#///////////////////////////////////////////////////////////////////////////////////////////

# n = int(input())
# for i in range(1, n // 2 + 2):
#     print('*' * i)
# for j in range(n // 2, 0, -1):
#     print('*' * j)
#
# решение через вложенный цикл:
#
# n = int(input())
#
# for i in range(n):
#     cur_cnt = (n // 2 + 1) - abs(n // 2 - i)
#     for j in range(cur_cnt):
#         print("*", end="")
#     print()

#///////////////////////////////////////////////////////////////////////////////////////////
# n = int(input())
# for i in range(1, n + 1):
#     for j in range(1, i + 1):
#         print(i, end='')
#     print()


#///////////////////////////////////////////////////////////////////////////////////////////

# total = 0
# for x in range(1, 65):
#     for y in range(1, 60):
#         if 12 * x + 13 * y == 777:
#             total += 1
#             print('x =', x, 'y =', y)
# print('Общее количество натуральных решений =', total)

#///////////////////////////////////////////////////////////////////////////////////////////

# total = 0
# for x in range(1, 45):
#     for y in range(1, 45):
#         for z in range(1, 45):
#             if x ** 2 + y ** 2 + z ** 2 == 2020:
#                 total += 1
#                 print('x =', x, 'y =', y, 'z =', z)
# print('Общее количество натуральных решений =', total)

#///////////////////////////////////////////////////////////////////////////////////////////

# 28n+30k+31m=365

# total = 0
# for n in range(1, 14):
#     for k in range(1, 13):
#         for m in range(1, 12):
#             if 28 * n + 30 * k + 31 * m == 365:
#                 total += 1
#                 print('n =', n, 'k =', k, 'm =', m)
# print('Общее количество натуральных решений =', total)

#///////////////////////////////////////////////////////////////////////////////////////////

# Имеется 100 рублей. Сколько быков, коров и телят можно купить на все эти деньги, если плата за быка – 10 рублей, за корову –
# 5 рублей, за телёнка – 0.5 рубля и надо купить 100 голов скота?
#
# Примечание. Используйте вложенный цикл for.

# Система уравнений:
#
# 10*B+5*K+0.5*T=100 (рублей)
#
# B+K+T=100 (шт. или голов)
# где
# В - быки
# К- коровы
# Т - телята
# Если быков b, коров c, телят d, то должны выполняться следующие условия:
#
# 10b + 5c + 0.5d = 100 (если можно, чтобы деньги остались, то вместо равенства надо поставить ≤)
#
# b + c + d = 100
#
# Можно поступить так: перебираем b, c, d от 0 до 100 и выводим эту тройку на экран, если выполняются оба условия.
#
# Псевдокод:
#
# для a от 0 до 100:
#
#    для b от 0 до 100:
#
#        для c от 0 до 100:
#
#            если (10b + 5c + 0.5d = 100) и (b + c + d = 100):
#
#                вывод a, b, c


# total = 0
# for b in range(0, 100):
#     for k in range(0, 100):
#         for t in range(0, 100):
#             if (10 * b + 5 * k + 0.5 * t == 100) and (b + k + t == 100):
#                 total += 1
#                 print('b =', b, 'k =', k, 't =', t)
# print('Общее количество натуральных решений =', total)

#///////////////////////////////////////////////////////////////////////////////////////////

# В 1769 году Леонард Эйлер сформулировал обобщенную версию Великой теоремы Ферма, предполагая, что по крайней мере nn
# энных степеней необходимо для получения суммы, которая сама является энной степенью для n > 2. Напишите программу для
# опровержения гипотезы Эйлера (продержавшейся до 1967 года), и найдите четыре положительных целых числа, сумма 5-х
# степеней которых равна 5-й степени другого положительного целого числа.
#
# Таким образом, найдите пять натуральных чисел a, b, c, d, e удовлетворяющих условию:
# a^5+b^5+c^5+d^5=e^5.
#
# В ответе укажите сумму a+b+c+d+e
#
# Примечание 1. Используйте вложенный цикл for.
#
# Примечание 2. Считайте, что числа a, b, c, d, e не превосходят 150.


# for a in range(1,151):
#     for b in range(a,151):
#         for c in range(b,151):
#             for d in range(c,151):
#                 for e in range(d,151):
#                     if a**5+b**5+c**5+d**5==e**5:
#                         print(a+b+c+d+e)


# p = [x ** 5 for x in range(151)]
# pw = set(p)
# for a in range(1, 151):
#     for b in range(a, 151):
#         for c in range(b, 151):
#             for d in range(c, 151):
#                 s = p[a] + p[b] + p[c] + p[d]
#                 if s in pw:
#                     print(a, b, c, d, p.index(s))
#                     print(a + b + c + d + p.index(s))

#///////////////////////////////////////////////////////////////////////////////////////////

# Дано натуральное число
# n
# n. Напишите программу, которая печатает численный треугольник с высотой, равной
# n
# n, в соответствии с примером:
#
# 1
# 2 3
# 4 5 6
# 7 8 9 10
# 11 12 13 14 15
# 16 17 18 19 20 21
# ...
#
# Формат входных данных
# На вход программе подаётся одно натуральное число.
#
# Формат выходных данных
# Программа должна вывести треугольник в соответствии с условием.
#
# Примечание. Используйте вложенный цикл for.

# total = 0
# n = int(input())
# for i in range(1, n + 1):
#     for j in range(1, i + 1):
#         total += 1
#         print(total, end=' ')
#     print()

#///////////////////////////////////////////////////////////////////////////////////////////

# Дано натуральное число
# n. Напишите программу, которая печатает численный треугольник с высотой, равной
# n, в соответствии с примером:
#
# 1
# 121
# 12321
# 1234321
# 123454321
# ...
# Формат входных данных
# На вход программе подаётся одно натуральное число.
#
# Формат выходных данных
# Программа должна вывести треугольник в соответствии с условием.
#
# Примечание. Используйте вложенный цикл for.

# total = ''
# n = int(input())
# for i in range(1, n + 1):
#     total += '1'
#     print(int(total)*(int(total)), end=' ')
#     print()

